{"modelTopology":{"class_name":"Model","config":{"name":"model1","layers":[{"name":"input1","class_name":"InputLayer","config":{"batch_input_shape":[null,512],"dtype":"float32","sparse":false,"name":"input1"},"inbound_nodes":[]},{"name":"denseLayer","class_name":"Dense","config":{"units":64,"activation":"relu","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"denseLayer","trainable":true},"inbound_nodes":[[["input1",0,0,{}]]]},{"name":"outputLayer","class_name":"Dense","config":{"units":19,"activation":"softmax","use_bias":true,"kernel_initializer":{"class_name":"VarianceScaling","config":{"scale":1,"mode":"fan_avg","distribution":"normal","seed":null}},"bias_initializer":{"class_name":"Zeros","config":{}},"kernel_regularizer":null,"bias_regularizer":null,"activity_regularizer":null,"kernel_constraint":null,"bias_constraint":null,"name":"outputLayer","trainable":true},"inbound_nodes":[[["denseLayer",0,0,{}]]]}],"input_layers":[["input1",0,0]],"output_layers":[["outputLayer",0,0]]},"keras_version":"tfjs-layers 4.21.0","backend":"tensor_flow.js"},"weightsManifest":[{"paths":["weights.bin"],"weights":[{"name":"denseLayer/kernel","shape":[512,64],"dtype":"float32"},{"name":"denseLayer/bias","shape":[64],"dtype":"float32"},{"name":"outputLayer/kernel","shape":[64,19],"dtype":"float32"},{"name":"outputLayer/bias","shape":[19],"dtype":"float32"}]}],"format":"layers-model","generatedBy":"TensorFlow.js tfjs-layers v4.21.0","convertedBy":null}